Ran Plan for dir: `terraform/kms/zerone-id/ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.7 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/15/default/terraform/kms/zerone-id/ap-northeast-2/kms::zerone-id::ap-northeast-2-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::066346343248:role/atlantis-zerone-id-admin'" in "/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/15/default/terraform/kms/zerone-id/ap-northeast-2": exit status 1
data.terraform_remote_state.iam: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_kms_alias.deployment_common_kms_alias will be created
  + resource "aws_kms_alias" "deployment_common_kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/deployment-common"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.deployment_common will be created
  + resource "aws_kms_key" "deployment_common" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for common secrets in ap-northeast-2."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "deployment-common"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::066346343248:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_kms_key_apne2_deployment_common_arn = (known after apply)

Error: AccessDenied: User: arn:aws:sts::066346343248:assumed-role/atlantis-ecs_task_execution/cdfd6c273e7f46aca22453a55dd2987d is not authorized to perform: s3:GetObject on resource: "arn:aws:s3:::zerone-id-apnortheast2-tfstate/provisioning/terraform/iam/zerone-id/terraform.tfstate" because no identity-based policy allows the s3:GetObject action
	status code: 403, request id: F3AQP9ZR64M6Y7KE, host id: wnW2nB4FJJtFrbhOo3CfRnRbp+WH+uanmfoTCoFo5bYGNBWdHfAI0k3LLrk0TdTKe8zeQVPVdo8VzTioqYgkabjMl8K7vQQQ


```
</details>

